[
    {
        "id": "proyectos_angular",
        "name": "Aprende Angular 8 desde 0 con 10 proyectos completos",
        "description": "<p>¡Bienvenidos a mi curso de <strong>Angular 8</strong>! Angular esta experimentando un crecimiento enorme en el desarrollo web Front-End, haciendo que si estas en este sector tarde o temprano tengas que aprender este framework Javascript de Google.</p> <p>En este curso, quiero que te inicies en este <strong>framework</strong> y lo haremos haciendo desde pequeñas aplicaciones a otras más complejas.</p> <p>Aprenderemos todos los componentes que forman Angular para hacer nuestras aplicaciones web.</p> <p>Estas serán las aplicaciones que haremos en este curso:</p> <ul> <li> <p><strong>Pregunta y respuestas</strong>: primera aplicación para empezar con lo más básico de angular, los componentes, la estructura de este y directivas *ngIf y *ngFor.</p> </li> <li> <p><strong>Lista de tareas</strong>: creamos nuestras propias tareas y podremos visualizar aquellas que estén completas y las que no. En esta app, aprenderemos como se comunican los componentes entre sí, usando Input y Output.</p> </li> <li><p><strong>Agenda de contactos</strong>: añadiremos nuestros contactos a través de un formulario y los visualizaremos en pantalla. Veremos el potencial de los formularios en Angular en esta app.</p> </li> <li> <p><strong>Cocktail app</strong>: usando la API de cocktaildb, realizaremos filtros para buscar nuestros cocktails preferidos. En esta app, veremos como usar los servicios para recoger información de fuera. También veremos como se crean y usan los modelos (clases).</p> </li> <li> <p><strong>Viajes soñados</strong>: Cargaremos una lista de países en una lista que podremos arrastrar y mover a otra lista usando drag and drop. Veremos como usar angular Material y directivas propias de angular.</p> </li> <li> <p><strong>Reservas peluqueria Juani: </strong>Usando un formulario, introduciremos los datos para añadir una reserva. Mediante un logueo, podremos ver las reservas que nos han creado. Las reservas se guardan en FireBase. El formulario será un formulario reactivo. </p> </li> <li> <p><strong>Burguer Queen: </strong>Imitamos los paneles de pedido rápido de las cadenas de comida rápida, repasando todo lo anterior pero aun mayor nivel. Los pedidos serán guardados en FireBase.</p> </li> <li> <p><strong>Dashboard:</strong>&nbsp;Parte trasera de la aplicación de blog dinámico, nos permitirá crear post y categorías. Veremos gráficas, herencia de componentes, guards y directivas propias. Todo se guarda en FireBase</p> </li> <li> <p><strong>Blog dinámico</strong>: Mostramos los posts guardamos a través de la aplicación dashboard, la aplicación es una imitación de mi web original, discoduroderoer.</p> </li> <li> <p><strong>Controla gastos</strong>: Aplicación para controlar nuestros gastos e ingresos para tener una idea global de como gastamos nuestro dinero, pudiendo crear nuevos usuarios y loguearnos en la app. Usaremos gráficas, detalles, animaciones, suscripciones, validadores personalizados, formularios, etc. Todo lo gestionaremos desde FireBase.</p> </li> </ul><p>Como extra, os agrego las aplicaciones que hacemos en Youtube y Twitch.</p> <p>¡Nos vemos en el curso!</p>",
        "img": "/assets/img/angular.jpg",
        "coupons": [
            {
                "price": "9.99",
                "url": "https://www.udemy.com/course/aprende-angular-desde-0-con-10-proyectos-completos/?couponCode=MARZO_DDR_3_2020",
                "dateStart": "2020-03-17T13:00:00",
                "dateEnd": "2020-03-22T01:00:00"
            }
        ]
    },
    {
        "id": "java_ejercicios",
        "name": "Aprende Java con 100 ejercicios prácticos (Incluye JavaFX)",
        "description": "<p>Curso de iniciación en <strong>Java </strong>de una forma amena y dinámica, enseñando de la mejor forma que sé hacer, haciendo ejercicios.</p><p>La versión que usaremos en este curso es <strong>Java SE</strong>&nbsp;(<strong>Standard Edition</strong>).</p><p>El curso consta de <strong>100 ejercicios prácticos (+50 ejercicios bonus)</strong> realizados en <strong>Java</strong> explicados y resueltos paso a paso, haremos desde ejercicios muy simples (pedir números, mostrar datos, etc) hasta ejercicios mas complejos (movimiento de una pieza de ajedrez) ayudándote a mejorar la lógica de programación para tus futuros proyectos. </p><p>Este curso es altamente recomendable para aquellas personas que comiencen un curso de formación profesional <strong>DAM/DAW</strong>, empiecen la <strong>universidad</strong> o cualquier persona que quiera empezar de alguna manera a programar.</p><p>Los ejercicios están divididos en las siguientes secciones:</p><ul><li><p><strong>Básicos:</strong> aprenderemos los conceptos básicos como los tipos de variables, operadores, estructuras repetitivas o bucles, estructuras condicionales, etc.</p></li><li><p><strong>Funciones y métodos:</strong> aprenderemos como crear funciones y métodos útiles que podremos reutilizar durante el curso.</p></li><li><p><strong>Arrays o vectores:</strong> aprenderemos a crear, rellenar, recorrer <strong>estructuras de datos estáticas</strong> simples. Terminaremos esta sección con el juego del <strong>ahorcado</strong>.</p></li><li><p><strong>Arrays multidimensionales o matrices:</strong> aprenderemos a crear, rellenar, recorrer estructuras de datos estáticas multidimensionales. Terminaremos la sección haciendo el juego del <strong>buscaminas</strong>.</p></li><li><p><strong>Programación orientada a objetos o POO:</strong> aprenderemos los conceptos básicos sobre la programación orientada a objetos creando nuestras propias clases, veremos herencia, polimorfismo, etc. Haremos un <strong>aeropuerto</strong> que va a ir evolucionando durante las clases. Como ejercicio final, veremos un pequeño <strong>gestor de aeropuertos</strong> en consola.</p></li><li><p><strong>Arrays dinámicos (ArrayList):</strong> aprenderemos a crear, rellenar, recorrer <strong>estructuras de datos dinámicas</strong>. Usaremos la clase ArrayList de Java.</p></li><li><p><strong>Ficheros:</strong> aprenderemos como escribir y leer ficheros de <strong>texto, binarios y serializados</strong>.</p></li><li><p><strong>Expresiones regulares:</strong> aprenderemos como crear expresiones regulares.</p></li><li><p><strong>Interfaces gráficas (SWING):</strong> aprenderemos como crear aplicaciones gráficas con <strong>SWING</strong> de <strong>Java</strong>. En este caso, se dividen en ejercicios pero podría considerarse como un mini proyecto. Haremos un gestor de aeropuertos gráficos.</p></li><li><p><strong>Java + MySQL:</strong> aprenderemos como conectarnos a una base de datos MySQL y hacer operaciones de consulta, insertado, actualización y borrado de datos.</p></li><li><p><strong>JavaFX:</strong> aprenderemos como crear aplicaciones gráficas con <strong>JavaFX,</strong> la evolución de<strong> SWING. </strong>Haremos el mismo proyecto que hicimos con <strong>SWING</strong>, pero esta vez los datos los cogeremos de nuestra base de datos.</p></li></ul><p>Se ha agregado cuestionarios para repasar los conceptos en cada sección.</p><p>Y no todo acaba aquí, aparte de estos <strong>ejercicios</strong>, también tenemos canal de <strong>Youtube</strong> donde puedes complementar aún más todos estos ejercicios. </p><p>En mi <strong>web</strong>, también tienes disponibles manuales útiles para documentarte.</p><p>Tienes los enlaces en mi perfil y también los comento en una clase.</p><p>Todos los ejercicios realizados durante el curso, los puedes descargar y usar para comprobar soluciones o modificarlo a tu gusto.</p><p>¡Te espero en el curso!</p>",
        "img": "/assets/img/java_100_ejercicios.jpg",
        "coupons": [
            {
                "price": "10.99",
                "url": "https://www.udemy.com/course/aprende-java-con-100-ejercicios-practicos/?couponCode=MARZO_DDR_3_2020",
                "dateStart": "2020-03-17T13:00:00",
                "dateEnd": "2020-03-22T01:00:00"
            }
        ]
    },
    {
        "id": "biblioteca_angular",
        "name": "Como crear tu propia biblioteca de componentes con angular",
        "description": "<p>Muchos desarrolladores de <strong>Angular </strong>utilizamos <strong>bibliotecas </strong>de terceros como <strong>Angular material</strong>, <strong>primeng</strong>, etc. pero, ¿y si pudiéramos crear nuestra propia biblioteca y compartirla con el resto del mundo? Pues esto lo vamos a ver en este curso.</p><p>Veremos como hacerlo desde 0 con angular, crearemos algunos componentes, pipes, servicios y directivas para que veas todo el potencial que se puede sacar.</p><p>Veremos como se puede subir a <strong>github </strong>y a <strong>npmjs </strong>y como se puede hacer documentación automáticamente con ComposeDoc. También nos crearemos una documentación personalizada como la de primeng.</p><p>Estos son los elementos que realizaremos:</p><ul><li><p><strong>Join</strong>:&nbsp;Pipe para unir varios elementos por el separador que nosotros le indiquemos.</p></li><li><p><strong>Spinner</strong>: Componente para esperar la carga de datos de la aplicación.</p></li><li><p><strong>Dropdown:</strong>&nbsp;Componente que nos permitirá elegir una serie de opciones, teniendo integrado un buscador.</p></li><li><p><strong>Toast</strong>:&nbsp;Componente que nos muestra mensajes de error, información, avisos o éxito. Como si fuera una notificación.</p></li><li><p><strong>ClickOutSide: </strong>Directiva que nos permite realizar alguna acción cuando clicamos fuera de un elemento concreto. </p></li><li><p><strong>LoadIframe:&nbsp;</strong>Directiva que nos permite indicar una acción al cargar un iframe con otra web.</p></li><li><p><strong>Config Service</strong>:&nbsp;Servicio para gestionar la información de un fichero JSON. Viene muy bien para el tema de configuración. </p></li><li><p><strong>Detail</strong>:&nbsp;Componente de un detalle base que podemos nosotros rellenar el contenido.</p></li><li><p><strong>Block-List</strong>:&nbsp;Componente que nos permite mostrar elementos en bloques, le podemos añadir una serie de acciones.</p></li></ul><p>En este curso, se realizara con Angular 8.</p><p>¡Disfrutar del curso!</p>",
        "img": "/assets/img/biblioteca_angular.png",
        "coupons": [
            {
                "price": "9.99",
                "url": "https://www.udemy.com/course/crea-tu-propia-biblioteca-de-componente-con-angular/?couponCode=MARZO_DDR_3_2020",
                "dateStart": "2020-03-17T13:00:00",
                "dateEnd": "2020-03-22T01:00:00"
            }
        ]
    },
    {
        "id": "sql_oracle_live",
        "name": "Como realizar consultas SQL con Oracle Live",
        "description": "<p>Hoy en día, para hacer una aplicación decente, necesitamos manejar bases de datos.</p><p>En este curso, aprenderás como realizar consultas en SQL sin experiencia previa, de las más simples a las más complejas.</p><p>Usaremos el entorno Oracle Live, no siendo necesario instalar nada en tu equipo.</p><p>Los temas a tratar son:</p><ul><li><p><strong>Consultas básicas:</strong> veremos como realizar consultas básicas usando <strong>SELECT, FROM, ORDER BY</strong>.</p></li><li><p><strong>Consultas con WHERE:</strong> veremos como filtrar los datos de nuestras consultas.</p></li><li><p><strong>Funciones:</strong> veremos que funciones útiles podemos utilizar para nuestras consultas.</p></li><li><p><strong>Consultas multitablas:</strong> veremos como realizar consultas con mas de una tabla.</p></li><li><p><strong>Consultas de agrupamientos:</strong> veremos como realizar consultas con datos agrupados.</p></li><li><p><strong>Condiciones de agrupamiento:</strong> veremos como filtrar los datos de nuestras consultas agrupadas.</p></li><li><p><strong>Subconsultas:</strong> veremos como realizar una consulta dentro de otra consulta.</p></li><li><p><strong>Conjuntos: </strong>veremos como realizar consultas con <strong>UNION </strong>,<strong>MINUS</strong>, <strong>INSERSECT</strong>, etc.</p></li><li><p><strong>SQL&nbsp;Joins: </strong>veremos como unir tablas de formas diferentes.</p></li><li><p><strong>Tablas temporales:</strong> veremos como utilizar las tablas temporales en nuestra consultas.</p></li><li><p><strong>Vistas:</strong> veremos como crear y utilizar las vistas.</p></li></ul><p>De todos estos temas, veremos una explicación teórica para introducirnos en el tema de lleno.</p><p>Podrás también pedir consultas personalizadas para aumentar el contenido del curso.</p><p>¡Os espero!</p><p><br></p><p><br></p>",
        "img": "/assets/img/sql_oracle_live.jpg",
        "coupons": [
            {
                "price": "9.99",
                "url": "https://www.udemy.com/course/aprende-a-realizar-consultas-sql-con-oracle-live/?couponCode=MARZO_2020_1_DDR",
                "dateStart": "2020-03-24T18:00:00",
                "dateEnd": "2020-03-28T19:00:00"
            }
        ]
    }
]